SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG28/Include/efr32zg28_lesense.h
/* Bit fields for LESENSE CH_EVALTHRES */
#define _LESENSE_CH_EVALTHRES_RESETVALUE             0x00000000UL                                   /**< Default value for LESENSE_CH_EVALTHRES      */
#define _LESENSE_CH_EVALTHRES_MASK                   0x0000FFFFUL                                   /**< Mask for LESENSE_CH_EVALTHRES               */
#define _LESENSE_CH_EVALTHRES_EVALTHRES_SHIFT        0                                              /**< Shift value for LESENSE_EVALTHRES           */
#define _LESENSE_CH_EVALTHRES_EVALTHRES_MASK         0xFFFFUL                                       /**< Bit mask for LESENSE_EVALTHRES              */
#define _LESENSE_CH_EVALTHRES_EVALTHRES_DEFAULT      0x00000000UL                                   /**< Mode DEFAULT for LESENSE_CH_EVALTHRES       */
#define LESENSE_CH_EVALTHRES_EVALTHRES_DEFAULT       (_LESENSE_CH_EVALTHRES_EVALTHRES_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_CH_EVALTHRES*/

/* Bit fields for LESENSE ST_ARC */
#define _LESENSE_ST_ARC_RESETVALUE                   0x00000000UL                               /**< Default value for LESENSE_ST_ARC            */
#define _LESENSE_ST_ARC_MASK                         0x003FFFFFUL                               /**< Mask for LESENSE_ST_ARC                     */
#define _LESENSE_ST_ARC_SCOMP_SHIFT                  0                                          /**< Shift value for LESENSE_SCOMP               */
#define _LESENSE_ST_ARC_SCOMP_MASK                   0xFUL                                      /**< Bit mask for LESENSE_SCOMP                  */
#define _LESENSE_ST_ARC_SCOMP_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define LESENSE_ST_ARC_SCOMP_DEFAULT                 (_LESENSE_ST_ARC_SCOMP_DEFAULT << 0)       /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */
#define _LESENSE_ST_ARC_SMASK_SHIFT                  4                                          /**< Shift value for LESENSE_SMASK               */
#define _LESENSE_ST_ARC_SMASK_MASK                   0xF0UL                                     /**< Bit mask for LESENSE_SMASK                  */
#define _LESENSE_ST_ARC_SMASK_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define LESENSE_ST_ARC_SMASK_DEFAULT                 (_LESENSE_ST_ARC_SMASK_DEFAULT << 4)       /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */
#define _LESENSE_ST_ARC_CURSTATE_SHIFT               8                                          /**< Shift value for LESENSE_CURSTATE            */
#define _LESENSE_ST_ARC_CURSTATE_MASK                0x1F00UL                                   /**< Bit mask for LESENSE_CURSTATE               */
#define _LESENSE_ST_ARC_CURSTATE_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define LESENSE_ST_ARC_CURSTATE_DEFAULT              (_LESENSE_ST_ARC_CURSTATE_DEFAULT << 8)    /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */
#define _LESENSE_ST_ARC_PRSACT_SHIFT                 13                                         /**< Shift value for LESENSE_PRSACT              */
#define _LESENSE_ST_ARC_PRSACT_MASK                  0xE000UL                                   /**< Bit mask for LESENSE_PRSACT                 */
#define _LESENSE_ST_ARC_PRSACT_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define _LESENSE_ST_ARC_PRSACT_NONE                  0x00000000UL                               /**< Mode NONE for LESENSE_ST_ARC                */
#define _LESENSE_ST_ARC_PRSACT_PRS0                  0x00000001UL                               /**< Mode PRS0 for LESENSE_ST_ARC                */
#define _LESENSE_ST_ARC_PRSACT_UP                    0x00000001UL                               /**< Mode UP for LESENSE_ST_ARC                  */
#define _LESENSE_ST_ARC_PRSACT_PRS1                  0x00000002UL                               /**< Mode PRS1 for LESENSE_ST_ARC                */
#define _LESENSE_ST_ARC_PRSACT_DOWN                  0x00000002UL                               /**< Mode DOWN for LESENSE_ST_ARC                */
#define _LESENSE_ST_ARC_PRSACT_PRS01                 0x00000003UL                               /**< Mode PRS01 for LESENSE_ST_ARC               */
#define _LESENSE_ST_ARC_PRSACT_PRS2                  0x00000004UL                               /**< Mode PRS2 for LESENSE_ST_ARC                */
#define _LESENSE_ST_ARC_PRSACT_PRS02                 0x00000005UL                               /**< Mode PRS02 for LESENSE_ST_ARC               */
#define _LESENSE_ST_ARC_PRSACT_UPANDPRS2             0x00000005UL                               /**< Mode UPANDPRS2 for LESENSE_ST_ARC           */
#define _LESENSE_ST_ARC_PRSACT_PRS12                 0x00000006UL                               /**< Mode PRS12 for LESENSE_ST_ARC               */
#define _LESENSE_ST_ARC_PRSACT_DOWNANDPRS2           0x00000006UL                               /**< Mode DOWNANDPRS2 for LESENSE_ST_ARC         */
#define _LESENSE_ST_ARC_PRSACT_PRS012                0x00000007UL                               /**< Mode PRS012 for LESENSE_ST_ARC              */
#define LESENSE_ST_ARC_PRSACT_DEFAULT                (_LESENSE_ST_ARC_PRSACT_DEFAULT << 13)     /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */
#define LESENSE_ST_ARC_PRSACT_NONE                   (_LESENSE_ST_ARC_PRSACT_NONE << 13)        /**< Shifted mode NONE for LESENSE_ST_ARC        */
#define LESENSE_ST_ARC_PRSACT_PRS0                   (_LESENSE_ST_ARC_PRSACT_PRS0 << 13)        /**< Shifted mode PRS0 for LESENSE_ST_ARC        */
#define LESENSE_ST_ARC_PRSACT_UP                     (_LESENSE_ST_ARC_PRSACT_UP << 13)          /**< Shifted mode UP for LESENSE_ST_ARC          */
#define LESENSE_ST_ARC_PRSACT_PRS1                   (_LESENSE_ST_ARC_PRSACT_PRS1 << 13)        /**< Shifted mode PRS1 for LESENSE_ST_ARC        */
#define LESENSE_ST_ARC_PRSACT_DOWN                   (_LESENSE_ST_ARC_PRSACT_DOWN << 13)        /**< Shifted mode DOWN for LESENSE_ST_ARC        */
#define LESENSE_ST_ARC_PRSACT_PRS01                  (_LESENSE_ST_ARC_PRSACT_PRS01 << 13)       /**< Shifted mode PRS01 for LESENSE_ST_ARC       */
#define LESENSE_ST_ARC_PRSACT_PRS2                   (_LESENSE_ST_ARC_PRSACT_PRS2 << 13)        /**< Shifted mode PRS2 for LESENSE_ST_ARC        */
#define LESENSE_ST_ARC_PRSACT_PRS02                  (_LESENSE_ST_ARC_PRSACT_PRS02 << 13)       /**< Shifted mode PRS02 for LESENSE_ST_ARC       */
#define LESENSE_ST_ARC_PRSACT_UPANDPRS2              (_LESENSE_ST_ARC_PRSACT_UPANDPRS2 << 13)   /**< Shifted mode UPANDPRS2 for LESENSE_ST_ARC   */
#define LESENSE_ST_ARC_PRSACT_PRS12                  (_LESENSE_ST_ARC_PRSACT_PRS12 << 13)       /**< Shifted mode PRS12 for LESENSE_ST_ARC       */
#define LESENSE_ST_ARC_PRSACT_DOWNANDPRS2            (_LESENSE_ST_ARC_PRSACT_DOWNANDPRS2 << 13) /**< Shifted mode DOWNANDPRS2 for LESENSE_ST_ARC */
#define LESENSE_ST_ARC_PRSACT_PRS012                 (_LESENSE_ST_ARC_PRSACT_PRS012 << 13)      /**< Shifted mode PRS012 for LESENSE_ST_ARC      */
#define _LESENSE_ST_ARC_NEXTSTATE_SHIFT              16                                         /**< Shift value for LESENSE_NEXTSTATE           */
#define _LESENSE_ST_ARC_NEXTSTATE_MASK               0x1F0000UL                                 /**< Bit mask for LESENSE_NEXTSTATE              */
#define _LESENSE_ST_ARC_NEXTSTATE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define LESENSE_ST_ARC_NEXTSTATE_DEFAULT             (_LESENSE_ST_ARC_NEXTSTATE_DEFAULT << 16)  /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */
#define LESENSE_ST_ARC_SETIF                         (0x1UL << 21)                              /**< Set interrupt flag                          */
#define _LESENSE_ST_ARC_SETIF_SHIFT                  21                                         /**< Shift value for LESENSE_SETIF               */
#define _LESENSE_ST_ARC_SETIF_MASK                   0x200000UL                                 /**< Bit mask for LESENSE_SETIF                  */
#define _LESENSE_ST_ARC_SETIF_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LESENSE_ST_ARC             */
#define LESENSE_ST_ARC_SETIF_DEFAULT                 (_LESENSE_ST_ARC_SETIF_DEFAULT << 21)      /**< Shifted mode DEFAULT for LESENSE_ST_ARC     */

/** @} End of group EFR32ZG28_LESENSE_BitFields */
/** @} End of group EFR32ZG28_LESENSE */
/** @} End of group Parts */

#endif // EFR32ZG28_LESENSE_H
